jose-villegas/esp32-c6-dev/launcher/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_PARTITION_TABLE_CUSTOM=y

# 1 kHz tick instead of the 100 Hz default. vTaskDelay(1) is the render loop's
# yield, and at 100 Hz that is a full 10 ms - a quarter of the frame budget.
# It also makes the touch task's 100 Hz polling land accurately rather than
# quantised to the tick.
CONFIG_FREERTOS_HZ=1000

# -O2 rather than the -Og default.
#
# This is a rendering device with no debugger attached: every frame is spent in
# rasterising, cellular automata and pixel loops, which are exactly what an
# optimiser helps and exactly what -Og leaves on the table. Measured effect is
# in docs/ESP32-C6-AMOLED-Notes.md.
CONFIG_COMPILER_OPTIMIZATION_PERF=y
